* C3算法的实现

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session C3
  import itertools


  def c3(cls, *mro_lists):
      # Make a copy so we don't change existing content
      mro_lists = [list(mro_list[:]) for mro_list in mro_lists]

      # Set up the new MRO with the class itself
      _mro = [cls]

      while True:
          # Reset for the next round of tests
          candidate_found = False

          for mro_list in mro_lists:
              if not len(mro_list):
                  # Any empty lists are of no use to the algorithm
                  continue

              # Get the first item as a potential candidate for the MRO
              candidate = mro_list[0]

              if candidate_found:
                  # Candidate promoted to the MRO are no longer of use
                  if candidate in _mro:
                      mro_list.pop(0)
                      # Don't bother checking any more candidate if one was found
                      # 注意这里continue的对齐是与if condidate_found对齐, 如果是与 if candidate in _mro对齐
                      # 则会导致结果不正确
                      # continue
                  continue

              if candidate in itertools.chain(*(x[1:] for x in mro_lists)):
                  # The candidate was found in an invalid position,
                  # so we move on to the next MRO list to get a new candidate
                  continue
              else:
                  # The candidate is valid and should be promoted to the MRO
                  _mro.append(candidate)
                  mro_list.pop(0)
                  candidate_found = True

          if not sum(len(mro_list) for mro_list in mro_lists):
              # There are no MROs th cycle through, so we're all done
              break
      return _mro


  print c3("C", ["B", "A", "object"], ["A", "object"], ["B", "A"])
#+END_SRC

#+RESULTS:
:RESULTS:
- ['C', 'B', 'A', 'object']
:END:

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session C3
  print c3("C", ["B", "A", "object"], ["A", "object"])
  print c3("C", ["A", "object"], ["B", "A", "object"])
#+END_SRC

#+RESULTS:
:RESULTS:
- ['C', 'B', 'A', 'object']
- ['C', 'B', 'A', 'object']
:END:
可见当没有`base classes`即`B, A`或者`A, B`参与C3算法时, 结果会都是一样的,
这明显和用户写类继承的寄望值不一致.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  def c3(*mro_lists):
      mro_lists = [list(mro_list) for mro_list in mro_lists]
      return mro_lists


  print c3("C", ["B", "A", object], ["A", object], ["B", "A"])
#+END_SRC

#+RESULTS:
:RESULTS:
- [['C'], ['B', 'A', <type 'object'>], ['A', <type 'object'>], ['B', 'A']]
:END:

* C3算法与现实的冲突
#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  class A(object):
      pass


  class B(A):
      pass


  class C(B, A):
      pass


  # class D(A, B):
  #     pass


  print C.__mro__
  # print D.__mro__
#+END_SRC

#+RESULTS:
:RESULTS:
- (<class '__main__.C'>, <class '__main__.B'>, <class '__main__.A'>, <type 'object'>)
:END:

#+BEGIN_SRC python
  class A(object):
      pass


  class B(A):
      pass


  class D(A, B):
      pass


  print D.__mro__
#+END_SRC

#+RESULTS:
:RESULTS:
TypeErrorTraceback (most recent call last)
<ipython-input-19-9349c6f8ca52> in <module>()
      7 
      8 
----> 9 class D(A, B):
     10     pass
     11 

TypeError: Error when calling the metaclass bases
    Cannot create a consistent method resolution
order (MRO) for bases B, A
:END:
为什么会出现上述的错误?
因为如果使用C3算法在计算`D.__mro__`时会进入无限循环状态,
即`c3("C", ["A", "object"], ["B", "A", "object"], ["A", "B"])`
所以Python为了让开发者写出有意义的类也是尽了很大的努力.

* C3算法的改进
增加抛出异常功能, 防止进入无限循环.

#+BEGIN_SRC python 
  import itertools


  def c3(cls, *mro_lists):
      # Make a copy so we don't change existing content
      mro_lists = [list(mro_list) for mro_list in mro_lists]

      # Set up the new MRO with the class itself
      _mro = [cls]

      while True:
          # Reset for the next round of tests
          candidate_found = False

          for mro_list in mro_lists:
              if not len(mro_list):
                  # Any empty lists are of no use to the algorithm
                  continue

              # Get the first item as a potential candidate for the MRO
              candidate = mro_list[0]

              if candidate_found:
                  # Candidate promoted to the MRO are no longer of use
                  if candidate in _mro:
                      mro_list.pop(0)
                      # Don't bother checking any more candidate if one was found
                  continue

              if candidate in itertools.chain(*(x[1:] for x in mro_lists)):
                  # The candidate was found in an invalid position,
                  # so we move on to the next MRO list to get a new candidate
                  continue
              else:
                  # The candidate is valid and should be promoted to the MRO
                  _mro.append(candidate)
                  mro_list.pop(0)
                  candidate_found = True

          if not sum(len(mro_list) for mro_list in mro_lists):
              # There are no MROs th cycle through, so we're all done
              break

          if not candidate_found:
              # No valid candidate was available, so we have to bail out
              raise TypeError("Inconsistent MRO")
              break
      return _mro


  print c3("C", ["B", "A", object], ["A", object], ["B", "A"])
  print c3("C", ["A", "object"], ["B", "A", "object"], ["A", "B"])
#+END_SRC

#+RESULTS:
:RESULTS:
- ['C', 'B', 'A', <type 'object'>]
TypeErrorTraceback (most recent call last)
<ipython-input-4-6991f94a6c7f> in <module>()
     50 
     51 print c3("C", ["B", "A", object], ["A", object], ["B", "A"])
---> 52 print c3("C", ["A", "object"], ["B", "A", "object"], ["A", "B"])

<ipython-input-4-6991f94a6c7f> in c3(cls, *mro_lists)
     44         if not candidate_found:
     45             # No valid candidate was available, so we have to bail out
---> 46             raise TypeError("Inconsistent MRO")
     47             break
     48     return _mro

TypeError: Inconsistent MRO
:END:

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  class BaseBase(object):
      def method(self):
          print "BaseBase"


  class Base1(BaseBase):
      pass


  class Base2(BaseBase):
      def method(self):
          print "Base2"


  class MyClass(Base1, Base2):
      pass


  here = MyClass()
  here.method()
#+END_SRC

#+RESULTS:
:RESULTS:
- Base2
:END:

* super()

#+BEGIN_SRC python :session 
  import logging

  logging.basicConfig(level=logging.DEBUG)


  class LoggingDict(dict):
      def __setitem__(self, key, value):
          logging.warning("Setting to %r" % key)
          super(LoggingDict, self).__setitem__(key, value)


  my_dict = LoggingDict()
  my_dict["hello"] = "world"
#+END_SRC

#+RESULTS:
:RESULTS:
- WARNING:root:Setting to 'hello'
:END:

使用`super()`的好处就是改变了父类`LoggingDict`但是可以不改变`super(LoggingDict, self).__setitem__()`
程序可以继续使用.

#+BEGIN_SRC python
  import logging
  import collections

  logging.basicConfig(level=logging.DEBUG)


  class LoggingDict(dict):
      def __setitem__(self, key, value):
          logging.warning("Setting to %r" % key)
          super(LoggingDict, self).__setitem__(key, value)


  class LoggingOD(LoggingDict, collections.OrderedDict):
      pass


  my_dict = LoggingOD()
  my_dict["hello"] = "world"
#+END_SRC

#+RESULTS:
:RESULTS:
- WARNING:root:Setting to 'hello'
:END:

* super()的建议
** The caller and callee need to have a matching argument signature
`super`用法的一个问题是初始化中的参数传递, 类在没有相同签名的情况下如何调用
其基类的`__init__`方法.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  class BaseBase(object):
      def __init__(self):
          print("BaseBase")
          super(BaseBase, self).__init__()


  class Base1(object):
      def __init__(self):
          print("Base1")
          super(Base1, self).__init__()


  class Base2(object):
      def __init__(self, arg):
          print("Base2")
          super(Base2, self).__init__()


  class MyClass(Base1, Base2):
      def __init__(self, arg):
          print("my class")
          super(MyClass, self).__init__(arg)


  m = MyClass(10)
#+END_SRC
#+RESULTS:
:RESULTS:
TypeErrorTraceback (most recent call last)
<ipython-input-38-1e3b9c6ad7cb> in <module>()
     23 
     24 
---> 25 m = MyClass(10)

<ipython-input-38-1e3b9c6ad7cb> in __init__(self, arg)
     20     def __init__(self, arg):
     21         print("my class")
---> 22         super(MyClass, self).__init__(arg)
     23 
     24 

TypeError: __init__() takes exactly 1 argument (2 given)
:END:

可以使用`*args`和`**kwds`魔法进行解决.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  class BaseBase(object):
      def __init__(self, *args, **kwds):
          print("BaseBase")
          super(BaseBase, self).__init__(*args, **kwds)


  class Base1(object):
      def __init__(self, *args, **kwds):
          print("Base1")
          super(Base1, self).__init__(*args, **kwds)


  class Base2(object):
      def __init__(self, arg, *args, **kwds):
          print("Base2")
          super(Base2, self).__init__(*args, **kwds)


  class MyClass(Base1, Base2):
      def __init__(self, arg, *args, **kwds):
          print("my class")
          super(MyClass, self).__init__(arg, *args, **kwds)


  m = MyClass(10)
#+END_SRC

#+RESULTS:
:RESULTS:
- my class
- Base1
- Base2
:END:

但是这是一个糟糕的修复方法, 因为它使用所有构造函数接受任何类型的参数, 这会导致
代码变得脆弱, 因为任何参数都被传递并且通过.
另一个解决方法是使用经典的`__init__`调用, 但是会导致混合`super`调用的缺陷.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  class Shape(object):
      def __init__(self, shapename, **kwds):
          self.shapename = shapename
          super(Shape, self).__init__(**kwds)


  class ColorShape(Shape):
      def __init__(self, color, **kwds):
          self.color = color
          super(ColorShape, self).__init__(**kwds)


  cs = ColorShape(color="red", shapename="circle")
#+END_SRC
每一层都剥下所需的关键字参数, 到最后剩下一个空字典用来送给一个不需要任何参数的
初始化函数, 比如`object__init__`.

** Make sure the target method exists

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session example
  class Root(object):
      def draw(self):
          # the delegation chain stops here
          assert not hasattr(super(Root, self), 'draw')


  class Shape(Root):
      def __init__(self, shapename, **kwds):
          self.shapename = shapename
          super(Shape, self).__init__(**kwds)

      def draw(self):
          print('Drawing.  Setting shape to:', self.shapename)
          super(Shape, self).draw()


  class ColoredShape(Shape):
      def __init__(self, color, **kwds):
          self.color = color
          super(ColoredShape, self).__init__(**kwds)

      def draw(self):
          print('Drawing.  Setting color to:', self.color)
          super(ColoredShape, self).draw()


  cs = ColoredShape(color='blue', shapename='square')
  cs.draw()
#+END_SRC

#+RESULTS:
:RESULTS:
- ('Drawing.  Setting color to:', 'blue')
- ('Drawing.  Setting shape to:', 'square')
:END:

#+BEGIN_SRC python
  class OtherShape(object):
      # def __init__(self, shapename, **kwds):
      #     self.shapename = shapename
      #     super(OtherShape, self).__init__(**kwds)

      def draw(self):
          print("OtherShape drawing.")


  class ColoredShape(Shape, OtherShape):
      def __init__(self, color, **kwds):
          self.color = color
          super(ColoredShape, self).__init__(**kwds)

      def draw(self):
          print('Drawing.  Setting color to:', self.color)
          super(ColoredShape, self).draw()


  cs = ColoredShape(color='blue', shapename='square')
  print([_.__name__ for _ in ColoredShape.__mro__])
  cs.draw()
#+END_SRC

#+RESULTS:
:RESULTS:
- ['ColoredShape', 'Shape', 'Root', 'OtherShape', 'object']
AssertionErrorTraceback (most recent call last)
<ipython-input-13-2e9fc128f5ba> in <module>()
     20 cs = ColoredShape(color='blue', shapename='square')
     21 print([_.__name__ for _ in ColoredShape.__mro__])
---> 22 cs.draw()

<ipython-input-13-2e9fc128f5ba> in draw(self)
     15     def draw(self):
     16         print('Drawing.  Setting color to:', self.color)
---> 17         super(ColoredShape, self).draw()
     18 
     19 

<ipython-input-6-d501db64976e> in draw(self)
     12     def draw(self):
     13         print('Drawing.  Setting shape to:', self.shapename)
---> 14         super(Shape, self).draw()
     15 
     16 

<ipython-input-6-d501db64976e> in draw(self)
      2     def draw(self):
      3         # the delegation chain stops here
----> 4         assert not hasattr(super(Root, self), 'draw')
      5 
      6 

AssertionError: 
:END:

原本期望的结果是:

#+RESULTS:
:RESULTS:
- ('Drawing.  Setting color to:', 'blue')
- ('Drawing.  Setting shape to:', 'square')
- ("OtherShape drawing.")
:END:

但是却出现了断言异常, 这是为什么?
在类`Root`中有一句断言`assert not hasattr(super, draw)`, 它的作用是防止类`ColorShape`从其他不是继承自类`Root`的
类继承来`draw`方法.
那么它是如何在判断到这种情况来抛出断言异常呢?
原因在于`__mro__`中类`OtherShape`是排在类`Root`后面的, 那么`super(Root, self)`指向类`OtherShape`, 通过
断言`Root`的后续类没有`draw`方法来及时抛出异常, 从而保证了`ColorShape`的`draw`不能从非继承类`Root`的其他类来继承.

If subclasses want to inject other classes into the MRO, 
those other classes also need to inherit from Root so that no path for calling draw() 
can reach object without having been stopped by Root.draw. 
This should be clearly documented 
so that someone writing new cooperating classes 
will know to subclass from Root. 
This restriction is not much different than 
Python’s own requirement that 
all new exceptions must inherit from BaseException.

注意, 在Python2中:
1. 在`class Root`中类`Root`必须显示的继承自`object`, 否则会出现
如下错误
```
TypeErrorTraceback (most recent call last)
<ipython-input-30-e3d6d6753f06> in <module>()
     25 
     26 
---> 27 cs = ColoredShape(color='blue', shapename='square')
     28 cs.draw()

<ipython-input-30-e3d6d6753f06> in __init__(self, color, **kwds)
     18     def __init__(self, color, **kwds):
     19         self.color = color
---> 20         super(ColoredShape, self).__init__(**kwds)
     21 
     22     def draw(self):

TypeError: must be type, not classobj

```
1. `super()`方法必须显示写明参数,即`super(type[,obj-or-type])`.
2. 在Python3没有上述注意点.
 
** Every occurrence of the method needs to user SUPER()
这是因为混用`super`和传统调用可能导致异常发生.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  class A(object):
      def __init__(self):
          print("A")
          super(A, self).__init__()


  class B(object):
      def __init__(self):
          print("B")
          super(B, self).__init__()


  class C(A, B):
      def __init__(self):
          print("C")
          A.__init__(self)
          B.__init__(self)


  c = C()
  print([_.__name__ for _ in C.__mro__])
#+END_SRC

#+RESULTS:
:RESULTS:
- C
- A
- B
- B
- ['C', 'A', 'B', 'object']
:END:

类`B`的初始化函数被调用两次, 因为类`C`实例对象调用`A.__init__(self)`,
根据`__mro__`, 从而`super(A, self)`再次调用了类`B`的初始化函数.

为了避免这些问题, 应该总是在子类化之前看看`__mro__`特性, 如果它不存在,
将要处理的就是一个旧式的类, 避免使用`super`可能更安全.
例如:

#+BEGIN_SRC python
  from SimpleHTTPServer import SimpleHTTPRequestHandler
  print(SimpleHTTPRequestHandler.__mro__)
#+END_SRC
#+RESULTS:
:RESULTS:
AttributeErrorTraceback (most recent call last)
<ipython-input-35-ed0221b0b0fe> in <module>()
      1 from SimpleHTTPServer import SimpleHTTPRequestHandler
----> 2 print(SimpleHTTPRequestHandler.__mro__)

AttributeError: class SimpleHTTPRequestHandler has no attribute '__mro__'
:END:

如果`__mro__`存在, 则快速查看每个MRO所涉及的类的构造程序代码, 如果到处都使用了
`super`, 那么可以使用它, 否则请保持一致.

`collections.deque`能够安全的被子类化, 可以使用`super`, 因为它直接
子类化`object`.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer value list :exports both :session
  from collections import deque
  deque.__mro__
#+END_SRC

#+RESULTS:
:RESULTS:
- : (collections.deque, object)
:END:

random.Random是存在于_random模块中的另一个类的封装,
是一个C模块, 所以是安全的

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output value :exports both :session
  from random import Random
  Random.__mro__
#+END_SRC

#+RESULTS:
:RESULTS:
: (random.Random, _random.Random, object)
:END:
* 如何解决第三方类不兼容问题
有时会遇到需要使用第三方类来继承, 但是第三方类方法或者不支持`super()`或者
没有继承自类`Roo`(就像前面的例子).
这时的解决方法是使用适配器类.

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session adapter
  class Root(object):
      def draw(self):
          # the delegation chain stops here
          assert not hasattr(super(Root, self), 'draw')


  class Shape(Root):
      def __init__(self, shapename, **kwds):
          self.shapename = shapename
          super(Shape, self).__init__(**kwds)

      def draw(self):
          print('Drawing.  Setting shape to:', self.shapename)
          super(Shape, self).draw()


  class ColoredShape(Shape):
        def __init__(self, color, **kwds):
            self.color = color
            super(ColoredShape, self).__init__(**kwds)

        def draw(self):
            print('Drawing.  Setting color to:', self.color)
            super(ColoredShape, self).draw()


  class Moveable(object):
      def __init__(self, x, y):
          self.x = x
          self.y = y
      
      def draw(self):
          print("Drawing at position: ", self.x, self.y)
#+END_SRC

#+RESULTS:
:RESULTS:

:END:

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session adapter
  class MoveableAdapter(Root):
      def __init__(self, x, y, **kwds):
          self.movable = Moveable(x, y)
          super(MoveableAdapter, self).__init__(**kwds)
      
      def draw(self):
          self.movable.draw()
          super(MoveableAdapter, self).draw()
  

  class MovableColoredShape(ColoredShape, MoveableAdapter):
      pass
  mcs = MovableColoredShape(color="red", shapename="circle",
                          x=10, y=20)
  mcs.draw() 
#+END_SRC

#+RESULTS:
:RESULTS:
- ('Drawing.  Setting color to:', 'red')
- ('Drawing.  Setting shape to:', 'circle')
- ('Drawing at position: ', 10, 20)
:END:

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer values list :exports both :session adapter
[_.__name__ for _ in MovableColoredShape.__mro__]
#+END_SRC

#+RESULTS:
:RESULTS:
- #+BEGIN_EXAMPLE
- ['MovableColoredShape',
- 'ColoredShape',
- 'Shape',
- 'MoveableAdapter',
- 'Root',
- 'object']
- #+END_EXAMPLE
:END:

* Just for fun

#+BEGIN_SRC ipython :preamble # -*- coding: utf-8 -*- :results raw drawer output list :exports both :session
  from collections import Counter, OrderedDict


  class OrderedCounter(Counter, OrderedDict):
      "Counter that remembers the order elements are first see"
      def __repr__(self):
        return "%s(%r)" % (self.__class__.__name__,
                          OrderedDict(self))
                          
      def __reduce__(self):
          return self.__class__, (OrderedDict(self),)
                      

  oc = OrderedCounter("abracadabra")
  print(repr(oc))
  print oc.__class__
#+END_SRC

#+RESULTS:
:RESULTS:
- OrderedCounter(OrderedDict([('a', 5), ('b', 2), ('r', 2), ('c', 1), ('d', 1)]))
- <class '__main__.OrderedCounter'>
:END:
